```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.service_account.google_service_account.sa_deployment: Refreshing state... [id=projects/bngo-app/serviceAccounts/service-account-tpv@bngo-app.iam.gserviceaccount.com]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/bngo-app/locations/europe-west1-c/clusters/tpv-gke-cluster]
module.gke.google_container_node_pool.primary_preemptible_nodes: Refreshing state... [id=projects/bngo-app/locations/europe-west1-c/clusters/tpv-gke-cluster/nodePools/tpv-node-pool]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.container_registry.google_container_registry.registry-tpv will be created
  + resource "google_container_registry" "registry-tpv" {
      + bucket_self_link = (known after apply)
      + id               = (known after apply)
      + location         = "EU"
      + project          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```